def gauss_solve(A, b):
    n = len(b)
    A = [row[:] for row in A]
    b = b[:] #копія елементів для безпечної роботи

#cуть  методу А * с = b -> підрахувати коефіцієнти. підготовка прямий хід, зворотній хід
    for k in range(n):
        # вибір головного елемента по стовпцю: під головною діагоналлю мають бути  0

        max_row = k
        for i in range(k + 1, n): #всі рядки строго нижче поточного рядка k цього ж стовпця
            if abs(A[i][k]) > abs(A[max_row][k]): #перевірка чи знизу є число за фіксоване k
                max_row = i
        A[k], A[max_row] = A[max_row], A[k] #міняємо місцями найбільше значення і попереднє
        b[k], b[max_row] = b[max_row], b[k] #те саме у векторі робим

        pivot = A[k][k] #найбільше число у стовпці запис -> щоб потім ділити решту на більше число і не було дробів
        if abs(pivot) < 1e-12:
            raise ValueError("сингулярна матриця")

        for i in range(k + 1, n): #рядки і нижче головного рядка k
            factor = A[i][k] / pivot #пошук множника для домноження головного рядка
            for j in range(k + 1, n):
                A[i][j] -= factor * A[k][j] #від значення поточного рядка - значення головного рядка            b[i] -= factor * b[k]

    # зворотний хід - пошук невідомих коефіцієнтів
    coef = [0.0] * n
    for i in range(n - 1, -1, -1): #найнижчий рядок матриці, до -1 шоб захопити 0 рядок, крок зворотній
        # Відкидаємо вже обчислені підстановки від загального результату b[i] та ділимо залишок на власний множник A[i][i], щоб отримати чистий coef[i]
        coef[i] = (b[i] - sum(A[i][j] * coef[j] for j in range(i + 1, n))) / A[i][i]
    return coef