def form_matrix(x, m):
    """Формує ліву частину системи рівнянь для методу найменших квадратів.

    Матриця A є "каркасом" часу. Кожен її елемент A[i][j] обчислюється як
    сума всіх значень місяців (x), піднесених до степеня (i + j).

    Args:
        x (list of float): Незалежна змінна (номери місяців). Береться з
                            файлу data.csv.
        m (int): Степінь полінома. Береться з головного циклу (від 1 до 10).
                 Визначає розмір матриці: оскільки поліном степеня m має
                 (m + 1) коефіцієнтів, матриця матиме розмір (m+1) х (m+1).

    Returns:
        list of list of float: Двовимірний масив (матриця A), заповнений
                               готовими сумами для подальшого розв'язання.

    Внутрішні змінні:
        n (int): Кількість точок даних (у нашому випадку 24).
        A (list): Початково порожня квадратна матриця, заповнена нулями.
        i (int): Поточний рядок матриці.
        j (int): Поточний стовпець матриці.
        k (int): Індекс для перебору кожної з 24 точок даних при додаванні.
    """
    n = len(x)
    A = [[0.0] * (m + 1) for _ in range(m + 1)]
    for i in range(m + 1):
        for j in range(m + 1):
            for k in range(n):
                A[i][j] += x[k] ** (i + j)
    return A


def form_vector(x, y, m):

    """Формує праву частину системи рівнянь (вектор b) для МНК.

    Вектор b пов'язує час із реальною температурою. Кожен його елемент b[i]
    обчислюється як сума добутків реальної температури (y) на місяць (x)
    у степені (i).

    Args:
        x (list of float): Незалежна змінна (номери місяців). Береться з файлу.
        y (list of float): Залежна змінна (реальні температури). Береться з файлу.
        m (int): Степінь полінома. Визначає висоту вектора-стовпчика (m + 1).

    Returns:
        list of float: Одновимірний масив (вектор b), що виступає як
                       результат системи рівнянь.

    Внутрішні змінні:
        n (int): Кількість точок даних (24 місяці).
        b (list): Початково порожній вектор-стовпчик, заповнений нулями.
        i (int): Поточний рядок (позиція) у векторі.
        k (int): Індекс для одночасного перебору місяців (x) та температур (y).
    """
    n = len(x)
    b = [0.0] * (m + 1)
    for i in range(m + 1):
        for k in range(n):
            b[i] += y[k] * (x[k] ** i)
    return b