
"""Модуль для поліноміальної апроксимації температурних даних.

Цей скрипт реалізує побудову математичної моделі зміни температури
за 24 місяці за допомогою Методу найменших квадратів (МНК) та
оцінює її точність через обчислення дисперсії.

Математичне обґрунтування:
    1. Поліноміальна модель:
       Функція: φ(x) = c_0 + c_1*x + c_2*x^2 + ... + c_m*x^m
       - Степінь `m`: визначає гнучкість кривої.
         m=1 (пряма), m=2 (парабола), m=10 (максимально гнучка крива).
       - Коефіцієнти `c`: підбираються автоматично алгоритмом МНК
         (через розв'язання СЛАР методом Гауса). - зроблено

    2. Дисперсія:
       Формула: δ = √[ Σ(φ(x_i) - f_i)² / (n+1) ]
       Дисперсія показує середнє відхилення побудованої кривої від реальних точок.
       Чим менша дисперсія (δ), тим точніше поліном описує історичні дані.

Змінні у коді
    x, xi       : Незалежна змінна (номери місяців 1..24).
    y_true (f_i): Реальні значення температур з вибірки.
    y_approx    : Температури, розраховані поліномом φ(x_i).
    m           : Степінь полінома (від 1 до 10).
    coef        : Знайдені коефіцієнти полінома [c_0, c_1, ..., c_m].
    delta (δ)   : Значення дисперсії для конкретного степеня `m`.

Note:
    Для поліномів високих степенів спостерігається
    мінімальна дисперсія на навчальній вибірці [1; 24], проте при
    спробі екстраполяції  виникає (overfitting), що призводить до неадекватних значень.
"""

def eval_polynomial(x_val, coef):
    result = 0.0
    px = 1.0
    for c in coef:
        result += c * px
        px *= x_val
    return result


def compute_variance(y_true, y_approx):
    """
формула дисперсії
    δ = √[ Σ(φ(x_i) - f_i)² / (n+1) ]

    """
    n = len(y_true)
    sum_sq = sum((y_true[i] - y_approx[i]) ** 2 for i in range(n))
    return (sum_sq / (n + 1)) ** 0.5